Revit 2027 API
ScheduleDefinition.ShowGrandTotal Property
 Indicates if a grand total row should be displayed at the bottom of the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGrandTotal { get; set; }
Public Property ShowGrandTotal As Boolean
	Get
	Set
public:
property bool ShowGrandTotal {
	bool get ();
	void set (bool value);
}
member ShowGrandTotal : bool with get, set
Property Value
Boolean
 True if a grand total row should be displayed, false otherwise.
Remarks
 The grand total row displays totals of each field for which totals are enabled. It can also optionally display a title (see ShowGrandTotalTitle) and a count of elements (see ShowGrandTotalCount).
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace